nixidee/ESP32-Soiltest/Claude/src/main.cpp
    ESP_LOGI(TAG, "Zigbee Report gesendet");
}

/**
 * Zigbee Task (läuft auf HP Core)
 */
void zigbeeTask(void *pvParameters) {
    ESP_LOGI(TAG, "Zigbee Task gestartet auf Core %d", xPortGetCoreID());
    
    // NVS initialisieren
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);
    
    // Zigbee Stack Konfiguration
    esp_zb_cfg_t zb_nwk_cfg = ESP_ZB_ZED_CONFIG();
    esp_zb_init(&zb_nwk_cfg);
    
    // Sleep aktivieren für Zigbee End Device
    esp_zb_sleep_enable(true);
    
    // Set device configuration
    esp_zb_set_primary_network_channel_set(1 << ZIGBEE_CHANNEL);
    esp_zb_set_extended_pan_id((uint8_t[]){0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00});
    
    // Attribute setzen
    esp_zb_set_attributes();
    
    // Endpoint Liste erstellen
    esp_zb_ep_list = esp_zb_ep_list_create();
    esp_zb_endpoint_config_t endpoint_config = {
        .endpoint = ENDPOINT_ID,
        .app_profile_id = ESP_ZB_AF_HA_PROFILE_ID,
        .app_device_id = ESP_ZB_HA_TEMPERATURE_SENSOR_DEVICE_ID,
        .app_device_version = 0
    };
    esp_zb_ep_list_add_ep(esp_zb_ep_list, esp_zb_cluster_list, endpoint_config);
    
    // Device registrieren
    esp_zb_device_register(esp_zb_ep_list);
    
    // Zigbee main loop starten
    ESP_ERROR_CHECK(esp_zb_start(false));
    esp_zb_main_loop_iteration();
    
    vTaskDelete(NULL);
}

// ==================== SENSOR TASK ====================

/**
 * Sensor Task - Liest periodisch Sensordaten und sendet Reports
 */
void sensorTask(void *pvParameters) {
    ESP_LOGI(TAG, "Sensor Task gestartet auf Core %d", xPortGetCoreID());
    
    TickType_t xLastWakeTime = xTaskGetTickCount();
    
    while (true) {
        // Warte auf Intervall oder Button
        if (button_pressed || 
            (xTaskGetTickCount() - xLastWakeTime) >= pdMS_TO_TICKS(measure_interval * 1000)) {
            
            button_pressed = false;
            xLastWakeTime = xTaskGetTickCount();
            
            // Sensordaten lesen
            readSensorData();
            
            // Zigbee Report senden
            if (zigbee_initialized) {
                sendZigbeeReport();
            }
            
            // Deep Sleep vorbereiten (falls aktiviert)
            if (ENABLE_DEEP_SLEEP && zigbee_initialized) {
                ESP_LOGI(TAG, "Gehe in Deep Sleep für %d Sekunden", measure_interval);
                
                // Wake-up Timer setzen
                esp_sleep_enable_timer_wakeup(measure_interval * 1000000ULL);
                
                // Wake-up bei Button Press
                esp_sleep_enable_ext0_wakeup((gpio_num_t)BUTTON_PIN, 0);
                
                // Deep Sleep starten
                esp_deep_sleep_start();
            }
        }
        
        // Task yield
        vTaskDelay(pdMS_TO_TICKS(100));
    }
}

// ==================== WEB SERVER ====================

/**
 * Web Server Root Handler
 */
void handleRoot() {
    if (!webServer) return;
    
    String html = "<html><head><title>ESP32-C6 Sensor</title>";
    html += "<meta charset='UTF-8'>";
    html += "<style>body{font-family:Arial;margin:20px;}";
    html += "table{border-collapse:collapse;}";
    html += "th,td{border:1px solid #ddd;padding:8px;text-align:left;}";
    html += "th{background-color:#4CAF50;color:white;}";
    html += "input{margin:5px;padding:5px;}";
    html += "</style></head><body>";
    html += "<h1>ESP32-C6 Umweltsensor</h1>";
    
    // Sensordaten Tabelle
    html += "<h2>Aktuelle Messwerte</h2>";
    html += "<table>";
    html += "<tr><th>Parameter</th><th>Wert</th></tr>";
    html += "<tr><td>Temperatur</td><td>" + String(current_data.temperature, 2) + " °C</td></tr>";
    html += "<tr><td>Luftfeuchtigkeit</td><td>" + String(current_data.humidity, 2) + " %</td></tr>";
    html += "<tr><td>Luftdruck</td><td>" + String(current_data.pressure, 2) + " hPa</td></tr>";
    html += "<tr><td>Abs. Luftfeuchtigkeit</td><td>" + String(current_data.abs_humidity, 2) + " g/m³</td></tr>";
    html += "<tr><td>Bodenfeuchte</td><td>" + String(current_data.soil_moisture) + " (";
    html += soilCategoryToString(current_data.soil_category);
    html += ")</td></tr>";
    html += "<tr><td>Batterie</td><td>" + String(current_data.battery_voltage, 2) + " V (";
    html += String(current_data.battery_percent) + "%)</td></tr>";
    html += "</table>";
    
    // Konfiguration
    html += "<h2>Konfiguration</h2>";
    html += "<form action='/config' method='POST'>";
    html += "Messintervall (Sek): <input type='number' name='interval' value='" + String(measure_interval) + "' min='10' max='3600'><br>";
    html += "WiFi SSID: <input type='text' name='ssid' value='" + String(WiFi.SSID()) + "'><br>";
    html += "WiFi Passwort: <input type='password' name='pass'><br>";
    html += "Deep Sleep: <input type='checkbox' name='deepsleep' " + String(ENABLE_DEEP_SLEEP ? "checked" : "") + "><br>";
    html += "<input type='submit' value='Speichern'>";
    html += "</form>";
    
    html += "<p><a href='/'>Aktualisieren</a> | <a href='/json'>JSON API</a></p>";
    html += "</body></html>";
    
    webServer->send(200, "text/html", html);
}

/**
 * Web Server JSON API Handler
 */
void handleJSON() {
    if (!webServer) return;
    
    String json = "{";
    json += "\"temperature\":" + String(current_data.temperature, 2) + ",";
    json += "\"humidity\":" + String(current_data.humidity, 2) + ",";
    json += "\"pressure\":" + String(current_data.pressure, 2) + ",";
    json += "\"abs_humidity\":" + String(current_data.abs_humidity, 2) + ",";
    json += "\"soil_moisture\":" + String(current_data.soil_moisture) + ",";
    json += "\"soil_category\":\"" + String(soilCategoryToString(current_data.soil_category)) + "\",";
    json += "\"battery_voltage\":" + String(current_data.battery_voltage, 2) + ",";
    json += "\"battery_percent\":" + String(current_data.battery_percent) + ",";
    json += "\"zigbee_connected\":" + String(zigbee_initialized ? "true" : "false") + ",";
    json += "\"wifi_connected\":" + String(WiFi.isConnected() ? "true" : "false") + ",";
    json += "\"measure_interval\":" + String(measure_interval);
    json += "}";
    
    webServer->send(200, "application/json", json);
}

/**
 * Web Server Config Handler
 */
void handleConfig() {
    if (!webServer) return;
    
