nixidee/ESP32-Soiltest/Claude/src/main.cpp
    if (webServer->hasArg("interval")) {
        measure_interval = webServer->arg("interval").toInt();
        if (measure_interval < MIN_MEASURE_INTERVAL) measure_interval = MIN_MEASURE_INTERVAL;
        if (measure_interval > MAX_MEASURE_INTERVAL) measure_interval = MAX_MEASURE_INTERVAL;
        preferences.putUInt("interval", measure_interval);
    }
    
    if (webServer->hasArg("ssid") && webServer->hasArg("pass")) {
        String ssid = webServer->arg("ssid");
        String pass = webServer->arg("pass");
        if (ssid.length() > 0) {
            preferences.putString("wifi_ssid", ssid);
            preferences.putString("wifi_pass", pass);
            // WiFi neu verbinden
            WiFi.disconnect();
            WiFi.begin(ssid.c_str(), pass.c_str());
        }
    }
    
    bool deep_sleep = webServer->hasArg("deepsleep");
    preferences.putBool("deep_sleep", deep_sleep);
    
    webServer->sendHeader("Location", "/");
    webServer->send(303);
}

/**
 * Web Server Task
 */
void webServerTask(void *pvParameters) {
    ESP_LOGI(TAG, "Web Server Task gestartet auf Core %d", xPortGetCoreID());
    
    if (!ENABLE_WEBSERVER) {
        vTaskDelete(NULL);
        return;
    }
    
    webServer = new WebServer(80);
    webServer->on("/", handleRoot);
    webServer->on("/json", handleJSON);
    webServer->on("/config", HTTP_POST, handleConfig);
    webServer->begin();
    
    ESP_LOGI(TAG, "Web Server gestartet auf Port 80");
    
    while (true) {
        if (webServer) {
            webServer->handleClient();
        }
        vTaskDelay(pdMS_TO_TICKS(10));
    }
}

// ==================== INTERRUPT HANDLER ====================

/**
 * Button Interrupt Handler
 */
void IRAM_ATTR buttonISR() {
    button_pressed = true;
}

// ==================== WIFI FUNKTIONEN ====================

/**
 * WiFi initialisieren
 */
void initWiFi() {
    if (!ENABLE_WIFI) {
        ESP_LOGI(TAG, "WiFi deaktiviert");
        return;
    }
    
    // WiFi Credentials aus Preferences laden
    String ssid = preferences.getString("wifi_ssid", DEFAULT_WIFI_SSID);
    String pass = preferences.getString("wifi_pass", DEFAULT_WIFI_PASSWORD);
    
    ESP_LOGI(TAG, "Verbinde mit WiFi SSID: %s", ssid.c_str());
    
    WiFi.mode(WIFI_STA);
    WiFi.begin(ssid.c_str(), pass.c_str());
    
    // Warte auf Verbindung (max 10 Sekunden)
    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < 20) {
        delay(500);
        ESP_LOGI(TAG, "WiFi verbindet...");
        attempts++;
    }
    
    if (WiFi.isConnected()) {
        wifi_enabled = true;
        ESP_LOGI(TAG, "WiFi verbunden! IP: %s", WiFi.localIP().toString().c_str());
    } else {
        ESP_LOGW(TAG, "WiFi Verbindung fehlgeschlagen");
        WiFi.disconnect();
        WiFi.mode(WIFI_OFF);
    }
}

// ==================== SETUP ====================

void setup() {
    // Serial für Debug
    Serial.begin(115200);
    delay(1000);
    ESP_LOGI(TAG, "=== ESP32-C6 Zigbee Sensor Start ===");
    ESP_LOGI(TAG, "Firmware Version: 1.0");
    ESP_LOGI(TAG, "Chip Model: %s", ESP.getChipModel());
    ESP_LOGI(TAG, "Chip Revision: %d", ESP.getChipRevision());
    ESP_LOGI(TAG, "Flash Size: %d KB", ESP.getFlashChipSize() / 1024);
    ESP_LOGI(TAG, "Free Heap: %d bytes", ESP.getFreeHeap());
    
    // Preferences initialisieren
    preferences.begin("sensor_config", false);
    measure_interval = preferences.getUInt("interval", DEFAULT_MEASURE_INTERVAL);
    
    // GPIO Setup
    pinMode(SOIL_SENSOR_POWER_PIN, OUTPUT);
    digitalWrite(SOIL_SENSOR_POWER_PIN, LOW);
    pinMode(LED_PIN, OUTPUT);
    digitalWrite(LED_PIN, LOW);
    pinMode(BUTTON_PIN, INPUT_PULLUP);
    
    // Button Interrupt
    attachInterrupt(digitalPinToInterrupt(BUTTON_PIN), buttonISR, FALLING);
    
    // I2C initialisieren für BME280
    Wire.begin(BME280_SDA_PIN, BME280_SCL_PIN);
    
    // BME280 initialisieren
    if (!bme.begin(0x76)) { // Adresse 0x76 oder 0x77
        ESP_LOGE(TAG, "BME280 nicht gefunden! Prüfe Verkabelung.");
        ESP_LOGI(TAG, "Versuche alternative Adresse 0x77...");
        if (!bme.begin(0x77)) {
            ESP_LOGE(TAG, "BME280 nicht gefunden auf beiden Adressen!");
        }
    } else {
        ESP_LOGI(TAG, "BME280 erfolgreich initialisiert");
        
        // BME280 Konfiguration für Low Power
        bme.setSampling(Adafruit_BME280::MODE_FORCED,     // Forced mode für Low Power
                       Adafruit_BME280::SAMPLING_X2,      // Temperatur oversampling x2
                       Adafruit_BME280::SAMPLING_X2,      // Druck oversampling x2
                       Adafruit_BME280::SAMPLING_X2,      // Feuchte oversampling x2
                       Adafruit_BME280::FILTER_X2,        // Filter x2
                       Adafruit_BME280::STANDBY_MS_1000); // Standby 1000ms
    }
    
    // ADC Konfiguration
    analogReadResolution(12); // 12 bit ADC (0-4095)
    analogSetAttenuation(ADC_11db); // Volle Range bis 3.3V
    
    // Initiale Sensordaten lesen
    readSensorData();
    
    // WiFi initialisieren (falls aktiviert)
    initWiFi();
    
    // Power Management für ESP32-C6 konfigurieren
    #ifdef CONFIG_PM_ENABLE
    esp_pm_config_t pm_config = {
        .max_freq_mhz = 160,
        .min_freq_mhz = 80,
        .light_sleep_enable = true
    };
    ESP_ERROR_CHECK(esp_pm_configure(&pm_config));
    ESP_LOGI(TAG, "Power Management aktiviert");
    #endif
    
    // Tasks erstellen mit Core-Zuordnung
    // Zigbee Task auf HP Core (Core 0)
    xTaskCreatePinnedToCore(
        zigbeeTask,
        "zigbee_task",
        8192,
        NULL,
        5,
        &zigbeeTaskHandle,
        0  // HP Core
    );
    
    // Sensor Task auf HP Core (Core 0)
    xTaskCreatePinnedToCore(
        sensorTask,
        "sensor_task",
        4096,
        NULL,
        3,
        &sensorTaskHandle,
        0  // HP Core
    );
    
    // Web Server Task auf HP Core (falls aktiviert)
    if (ENABLE_WEBSERVER && wifi_enabled) {
        xTaskCreatePinnedToCore(
            webServerTask,
            "web_task",
            4096,
            NULL,
            2,
            &webTaskHandle,
            0  // HP Core
        );
    }
    
    ESP_LOGI(TAG, "Setup abgeschlossen");
}

// ==================== MAIN LOOP ====================

void loop() {
    // Hauptloop bleibt leer, alles läuft in Tasks
    // Der LP Core kann hier für Low-Power Operationen genutzt werden
    
    // Heartbeat LED (zeigt dass System läuft)
    static unsigned long last_blink = 0;
    if (millis() - last_blink > 5000) {
        last_blink = millis();
        if (!zigbee_initialized) {
            // Blinke wenn nicht verbunden
            digitalWrite(LED_PIN, HIGH);
            delay(100);
            digitalWrite(LED_PIN, LOW);
        }
    }
    
    delay(100);
}